stephenshizl/kwproject/Sources/Middleware/Wireless/ieee_802_15_4_5.3.2/phy/source/MKW41Z/PhyPacketProcessor.c
    for(i=start; i<stop; i++)
    {
        /* Set the index value */
        phyReg = ZLL->SAM_TABLE;
        phyReg &= ~(ZLL_SAM_TABLE_SAM_INDEX_MASK     |
                    ZLL_SAM_TABLE_SAM_INDEX_WR_MASK  |
                    ZLL_SAM_TABLE_SAM_INDEX_INV_MASK |
                    ZLL_SAM_TABLE_SAM_INDEX_EN_MASK  |
                    ZLL_SAM_TABLE_FIND_FREE_IDX_MASK |
                    ZLL_SAM_TABLE_INVALIDATE_ALL_MASK );
        
        ZLL->SAM_TABLE = phyReg | (i << ZLL_SAM_TABLE_SAM_INDEX_SHIFT);
        /* Read checksum located at the specified index */
        phyReg = ZLL->SAM_TABLE;
        phyReg = (phyReg & ZLL_SAM_TABLE_SAM_CHECKSUM_MASK) >> ZLL_SAM_TABLE_SAM_CHECKSUM_SHIFT;

        if( phyReg == checksum )
        {
            return i;
        }
    }
    
    return -1;
}
#endif

/*! *********************************************************************************
* \brief  Change the XCVR DSM duration
*
* \param[in]  duration  the new XCVR sleep duration
*
********************************************************************************** */
void PhyPlmeSetDSMDuration(uint32_t duration)
{
    /* Minimum DSM duration */
    mPhyDSMDuration = RSIM->DSM_OSC_OFFSET + mPhyDSM_GuardTime_d;
    
    if( duration > mPhyDSMDuration )
    {
        mPhyDSMDuration = duration;
    }
}

/*! *********************************************************************************
* \brief  Change the XCVR power state
*
* \param[in]  state  the new XCVR power state
*
* \return  phyStatus_t
*
********************************************************************************** */
phyStatus_t PhyPlmeSetPwrState( uint8_t state )
{
    phyStatus_t status = gPhySuccess_c;
    static uint8_t mPhyPwrState = gPhyPwrIdle_c;

    /* Parameter validation */
    if( state > gPhyPwrReset_c )
    {
        status = gPhyInvalidParameter_c;
    }
    /* Check if the new power state = old power state */
    else if( state == mPhyPwrState )
    {
        status = gPhyBusy_c;
    }
    else
    {
        switch(state)
        {
        case gPhyPwrIdle_c:
            /* Set XCVR in run mode if not allready */
            if(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK)
            {
                RSIM->ZIG_WAKE = (RSIM->DSM_TIMER + mPhyDSM_GuardTime_d);
                while(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK);
            }
            break;

        case gPhyPwrDSM_c:
            /* Set XCVR in low power mode if not allready */
            if(!(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK))
            {
                uint32_t minTime = (RSIM->DSM_OSC_OFFSET > mPhyDSM_GuardTime_d) ? RSIM->DSM_OSC_OFFSET : mPhyDSM_GuardTime_d;

                RSIM->ZIG_SLEEP = RSIM->DSM_TIMER + minTime;
                RSIM->ZIG_WAKE = RSIM->DSM_TIMER + mPhyDSMDuration;
                RSIM->DSM_CONTROL |= RSIM_DSM_CONTROL_ZIG_SYSCLK_REQUEST_EN_MASK |
                                     RSIM_DSM_CONTROL_DSM_TIMER_EN_MASK | 
                                     RSIM_DSM_CONTROL_ZIG_SYSCLK_INTERRUPT_EN_MASK;
            }
            break;

        default:
            status = gPhyInvalidPrimitive_c;
            /* do not change current state */
            state = mPhyPwrState;
            break;
        }
        
        mPhyPwrState = state;
    }
    
    return status;
}
